"""给你两个整数a和b（0 < a,b < 1000),按笔算的格式输出a乘以b（a是被乘数，b是乘数）的运算过程，

最后再输出一行 “********************”（二十个星号）。

乘号用小写字母“x”表示，每行末尾不能有多余的空格。具体输出格式见下面的例子：

例1：

a=89, b=13,则输出：

      89

x     13

--------

     267

     89

--------

    1157

********************

例2：

a=2, b=2,则输出：

       2

x      2

--------

       4

********************"""
a = 2
b = 20

bcs = '%8d'%a
cs = 'x'+'%7d'%b

res = [bcs,cs,'--------']

l = list(map(int,str(b)))[::-1]
t = []
for i in range(0,len(l)):
       res.append('%*d'%(8-i,l[i]*a))
       t.append(l[i]*a*10**i)
if len(l) > 1:
       res.append('--------')
       ji = sum(t)
       res.append('%8d'%ji)
res.append('********************')

for i in res:
       print(i)


